<?php
class WordCorrection {
    
    
    public static $STOP_WORD = array(
        '的','了','是','末','啊','阿','哎','哎呀','哎哟','吧','别','此','哈','哈哈','比','边','并','并且','当','的话',//'和',
        '嘿','哼','哼唷','或','己','啦','嘛','吗','们','乃','呢','哦','呕','呸','且','让','如','若','啥','哇','喂','呜','呜呼',
        '嘻','向','像','焉','呀','也','因','吱','呃','呗','咚','咦','喏','啐','喔唷','嗬','嗯','嗳','着','唉','但','过','来',//'你',
        '呗','咚','咦','喏','啐','嗯','至','之','咋','哉','又','与','焉','起','凭','您','能','那','拿','么','哩','例如','来着',
        '况且','进而','较','几','即','及','或者','呼哧','呵','个','而','对','多','得','到','待','打','除','别的','兮','这','者',
        '怎','在','于','有','用',
    );
    //是否是中英文数字文
    public static function  isUseful($word) {
        if (preg_match('/[a-zA-Z0-9\x4e00-\x9fa5]+$/', $word, $match)){
            if($match != '') {
               return true; 
            }
        }
        return false;
    }
    
    public static function isStopWord($word) {
        if (in_array($word, self::$STOP_WORD)) {
            return true;
        }
        return false;
    }
}